<template>
<div class="body">
  <form class="reg">
    <div class="wrapper">
      <div class="header">
        <h1>тайный <br>санта</h1>
        <p class="corplife">#corplife</p>
      </div>

      <label for="name">Имя</label>
      <div class="input_block">
        <input v-model="name" id="name" type="text" required>
        <div class="info" data-title="hello"></div>
      </div>

      <label for="lastname">Фамилия</label>
      <div class="input_block">
        <input v-model="lastname" id="lastname" type="text" required>
        <div class="info" data-title="hello"></div>
      </div>

      <label for="email">Email</label>
      <div class="input_block">
        <input v-model="email" id="email" type="email" required>
        <div class="info" data-title="hello"></div>
      </div>

      <label for="pass">Пароль</label>
      <div class="input_block">
        <input v-model="password" id="pass" type="password" required>
        <div class="info" data-title="hello"></div>
      </div>
      
      <select name="Департаментs" v-model="Департаментs" required>
        <option v-for='item in data' :key='item' :value="item">{{item}}</option>
      </select>

      <select v-if='Департаментs != ""' name="branches" v-model="branches">
        <option v-for='item in branch' :key='item.branch' :value="item.branch" :disabled="item.Департамент != Департаментs ? '' : disabled"> <span>{{item.branch}}</span></option>
      </select>

      <router-link class="link" to="/profile"><button @click='toProf'>Регистрация</button></router-link>
    </div>
  </form>
</div>
</template>

<script>
export default {
  name: "RegBlock",
  data() {
      return {
        name: '',
        lastname: '',
        email: '',
        password: '',
        departments: '',
        branches: '',
        Департаментs: '',
        data: [
              'Департамент вычислительных систем',
              'Департамент маркетинга',
              'Департамент телекоммуникаций',
              'Департамент инженерных и мультимедийных систем',
              'Административно-эксплуатационная служба',
              'Служба охраны',
              'Транспортная служба',
              'Транспортная служба',
              'Департамент разработки программного обеспечения',
              'Департамент продаж и менеджмента проектов',
              'Администрация', 'Административно-эксплуатационная служба',
              'Правовой департамент',
              'Правовой департамент',
              'Департамент по работе с персоналом',
              'CROC digital insight',
              'Финансовый департамент',
              'Департамент по работе с персоналом',
              'Департамент бизнес-приложений',
              'Отдел промышленных решений',
              'Департамент информационных технологий',
              'Департамент внутренней автоматизации',
              'Департамент информационных технологий'
            ],
        branch: [
          {
            "branch": "служебное branch",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "финансово-аналитический отдел",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "отдел внутренней автоматизации",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "центральная служба технической поддержки",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "отдел управления проектами",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "сервис-менеджеры и сервис-администраторы",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа внедрения и эксплуатации вычислительных комплексов",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа управления проектами",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "полевые и сменные инженеры",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа поддержки продаж решений и сервисов",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "региональный сервис и доставка",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "маркетинговые исследования",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "переводы",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "пресс-служба",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "продвижение",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "тендеры",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "группа администраторов проектов",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Аудиовизуальные системы",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Внешние пользователи",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Телефония",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Транспортные сети - Nortel",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Транспортные сети - инсталляция",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Транспортные сети - проекты",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "ФД.отдел оптимизации бизнес-процессов",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "бойцы невидимого фронта",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "продажи решений",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "директора аккаунтов и менеджеры проектов",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа структурированных кабельных систем",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "администраторы (Navision) и помощники менеджеров",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "главный инженер",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "ДИЗ.группа закупок",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа инженеров-сметчиков",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "прорабы",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа энергоцентров",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа комплексных систем безопасности",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа комплексной автоматизации, диспетчеризации зданий и центров обработки данных",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "КРОК-Р",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "группа проектирования транспортных сетей",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа инсталляции транспортных сетей",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа телефонии",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа call-центров",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа администрирования и технического сопровождения проектов",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "КРОК-Р, Санкт-Петербург",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Нижний Новгород",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "группа эксплуатации центров обработки данных",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "КРОК-Р, Москва",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "КРОК-Р, Новосибирск",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "сервис-менеджеры",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "сервис-администраторы",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "проектные",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "обеспечение сервисных контрактов",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "Административный отдел",
            "Департамент": "Административно-эксплуатационная служба"
          },
          {
            "branch": "Отдел по эксплуатации инженерных систем",
            "Департамент": "Административно-эксплуатационная служба"
          },
          {
            "branch": "группа технических писателей",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "ДВС.группа 3D решений",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа разработки облака",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа технических менеджеров",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "Группа обеспечения контрольно-пропускного режима",
            "Департамент": "Служба охраны"
          },
          {
            "branch": "Группа обслуживания бизнеса",
            "Департамент": "Служба охраны"
          },
          {
            "branch": "Группа обеспечения перевозки сотрудников",
            "Департамент": "Транспортная служба"
          },
          {
            "branch": "Группа обслуживания и сервиса",
            "Департамент": "Транспортная служба"
          },
          {
            "branch": "группа инженеров-диспетчеров службы эксплуатации ЦОД",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "Группа слаботочных систем",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "Сметно-договорная группа",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "Краснодар",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "Воронеж",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "группа разработки иммерсивных технологий",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа продажи решений",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа управления проектами",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа аналитиков",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа внедренцев",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа управления разработкой",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа администраторов проектов",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа администраторов проектов по вычислительным системам",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа разработчиков Java",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа администраторов проектов по телекоммуникациям",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа разработки аппаратных решений",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа администраторов проектов и сметчиков по интеллектуальным зданиям",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа администраторов BackOffice",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "Воронеж",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "Санкт-Петербург",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа управления сервисными проектами",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "Челябинск",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа менеджеров по поддержке продаж",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа консультантов",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "группа системных администраторов",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "группа тестировщиков",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "группа управления проектами",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "группа аналитиков",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "Transformation office",
            "Департамент": "Администрация"
          },
          {
            "branch": "Strategy Consulting_old",
            "Департамент": "CROC digital insight"
          },
          {
            "branch": "Operations Management",
            "Департамент": "CROC digital insight"
          },
          {
            "branch": "Служба охраны труда, техники безопасности и гражданской обороны",
            "Департамент": "Административно-эксплуатационная служба"
          },
          {
            "branch": "группа Корпоративного сопровождения",
            "Департамент": "Правовой Департамент"
          },
          {
            "branch": "группа комплексного сопровождения проектов",
            "Департамент": "Правовой Департамент"
          },
          {
            "branch": "отдел кадров",
            "Департамент": "Департамент по работе с персоналом"
          },
          {
            "branch": "отдел обучения",
            "Департамент": "Департамент по работе с персоналом"
          },
          {
            "branch": "группа администраторов проектов по вычислительным системам и телекоммуникациям",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "отдел бизнес-приложений",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "Technology Consulting",
            "Департамент": "CROC digital insight"
          },
          {
            "branch": "Strategy Consulting",
            "Департамент": "CROC digital insight"
          },
          {
            "branch": "Проектные",
            "Департамент": "CROC digital insight"
          },
          {
            "branch": "Иркутск",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "Самара",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "Санкт-Петербург",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "Челябинск",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "группа разработчиков.net",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "Краснодар",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа тестировщиков",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "Отдел расчётов с клиентами",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "Пермь",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "ДТК.call-центры",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа аудиовизуальных систем",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа голосовых решений",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа менеджеров проектов",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа поддержки продаж решений",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Проектные",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа сетевых и коммуникационных решений",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Call-центр",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "операционный маркетинг",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "стратегический маркетинг",
            "Департамент": "Департамент маркетинга"
          },
          {
            "branch": "Отдел планирования и оптимизации расходов",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "отдел проектного учета и анализа",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "отдел планирования и проектного финансирования",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "отдел расчетов с клиентами",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "группа управления проектами по программному консалтингу",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "Проектные",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "Иркутск",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "отдел корпоративной культуры и внутренних коммуникаций",
            "Департамент": "Департамент по работе с персоналом"
          },
          {
            "branch": "Кипр",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "бухгалтерия",
            "Департамент": "Финансовый Департамент"
          },
          {
            "branch": "Сервис",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Санкт-Петербург",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "проектный отдел",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "группа консультантов по BI и хранилищам данных",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по анализу данных",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по анализу и автоматизации бизнес-процессов",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по внедрению бизнес-приложений",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по производству",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по технической архитектуре и разработке",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по финансам",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа консультантов по хранилищам данных и ETL",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа менеджеров по внедрению бизнес-приложений",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа развития и поддержки продаж",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "группа управления проектами по техническому консалтингу",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа управления проектами по интеллектуальным зданиям",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа управления проектами по вычислительной инфраструктуре ЦОД",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа управления комплексными проектами",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа продаж",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа закупок",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа отраслевых решений",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа продаж решений",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "Проектные",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа поддержки продаж облачных сервисов",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "группа технических менеджеров по промышленным решениям",
            "Департамент": "Отдел промышленных решений"
          },
          {
            "branch": "инженеры промышленных решений",
            "Департамент": "Отдел промышленных решений"
          },
          {
            "branch": "Санкт-Петербург",
            "Департамент": "Отдел промышленных решений"
          },
          {
            "branch": "Нижний Новгород",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "Самара",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "проектные",
            "Департамент": "Отдел промышленных решений"
          },
          {
            "branch": "отдел системных решений",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "проектные",
            "Департамент": "Департамент информационных технологий"
          },
          {
            "branch": "ДВС.интеллектуальные медиасистемы",
            "Департамент": "Департамент вычислительных систем"
          },
          {
            "branch": "ДТК.Видеоконференцсвязь",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "ДТК.Группа видеоконференцсвязи",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "ДТК.группа аудиовизуальных систем и видеоконференцсвязи",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Группа электромеханических систем",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "Сервисно-производственная группа",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "проектные",
            "Департамент": "Департамент бизнес-приложений"
          },
          {
            "branch": "технические менеджеры",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "Группа поддержки продаж",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "Группа систем безопасности",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "Проектные",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа инженеров по мультимедийным системам",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа технических менеджеров по мультимедийным системам",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа унифицированных коммуникаций",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа разработчиков бизнес-приложений",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "центральная служба технической поддержки",
            "Департамент": "Департамент внутренней автоматизации"
          },
          {
            "branch": "Группа СКС и Автоматизации инженерных систем",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа поддержки продаж",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа поддержки производства",
            "Департамент": "Департамент инженерных и мультимедийных систем"
          },
          {
            "branch": "группа развития бизнеса",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "Группа технических менеджеров по мультимедийным решениям",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "группа технических менеджеров",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Группа инженеров по мультимедийным решениям",
            "Департамент": "Департамент телекоммуникаций"
          },
          {
            "branch": "Пермь",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа управления проектами по телекоммуникациям",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа управления проектами и поддержки продаж",
            "Департамент": "Департамент продаж и менеджмента проектов"
          },
          {
            "branch": "группа робототехнических решений",
            "Департамент": "Департамент разработки программного обеспечения"
          },
          {
            "branch": "группа менеджеров по работе с партнерами",
            "Департамент": "Департамент информационных технологий"
          }
        ]
      }
    },
  methods: {
    toProf() {
      event.preventDefault(); 

      this.$emit('toProf', {
        'name': this.name,
        'lastname': this.lastname,
        'email': this.email,
        'password': this.password,
        'branches': this.branches,
        'departments': this.Департаментs,
      })
    }
  }
}
</script>

<style scoped>
  .body {
    height: 100%;
    width: 100%;
    position: absolute;
    top: 0;
    background-color: #00A460;
    background-image: url("../../assets/bg_icons.png");
    background-size: contain;
  }
  .wrapper {
    display: flex;
    flex-direction: column;
    margin-right: auto;
    margin-left: auto;
    max-width: 60%;
  }
  .reg {
    position: absolute;
    padding: 50px 30px;
    margin: 0 auto;
    left: 0;
    right: 0;
    top: 50%;
    transform: translate(0, -50%);
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    height: auto;
    width: 30%;
    border-radius: 40px;
    background-color: white;
    box-shadow: 3px 3px 8px rgba(0, 0, 0, 0.1);
  }
  .header {
    display: flex;
    justify-content: space-between;
  }
  label {
    color: #6B6B6B;
    padding-left: 20px;
    padding-bottom: 5px;
    padding-top: 20px;
    font-size: 18px;
  }
  input {
    outline: none;
    font-size: 20px;
    border-radius: 30px;
    border-style: solid;
    border-color: #DDDDDD;
    background-color: #FCFCFC;
    height: 45px;
    width: 98%;
    padding: 1%;
  }
  select {
    outline: none;
    padding-left: 10px;
    padding-right: 10px;
    margin-top: 30px;
    font-size: 20px;
    border-radius: 30px;
    border-style: solid;
    border-color: #DDDDDD;
    border-width: 2px;
    background-color: #FCFCFC;
    height: 45px;
    width: 100%;
  }
  button {
    outline: none;
    cursor: pointer;
    height: 60px;
    width: 100%;
    margin-top: 30px;
    background-color: #FF645A;
    border: none;
    color: white;
    border-radius: 30px;
    font-weight: bold;
    font-size: 24px;
  }
  h1 {
    font-size: 36px;
    line-height: 36px;
    color: #ff645a;
  }
  .header p {
    font-size: 24px;
    padding-top: 15px;
    color: #505050;
  }
  button:hover {
    background-color: #b04740;
  }
  @media screen and (max-width: 1665px) {
    label {
      padding-left: 20px;
      padding-bottom: 5px;
      padding-top: 20px;
      font-size: 15px;
    }
    input {
      font-size: 20px;
      height: 35px;
      width: 98%;
      padding: 1%;
    }
    select {
      padding-left: 10px;
      padding-right: 10px;
      margin-top: 30px;
      font-size: 20px;
      height: 35px;
      width: 100%;
    }
    button {
      height: 40px;
      width: 100%;
      margin-top: 30px;
      font-size: 20px;
    }
    h1 {
      font-size: 36px;
      line-height: 36px;
    }
    .header p {
      font-size: 24px;
      padding-top: 15px;
    }
    @media screen and (max-width: 1430px){
      .reg {
        padding: 10px 10px;
      }
      label {
        padding-left: 20px;
        padding-bottom: 5px;
        padding-top: 20px;
        font-size: 12px;
      }
      input {
        font-size: 16px;
        height: 35px;
        width: 98%;
        padding: 1%;
      }
      select {
        padding-left: 10px;
        padding-right: 10px;
        margin-top: 20px;
        font-size: 16px;
        height: 35px;
        width: 100%;
      }
      button {
        height: 40px;
        width: 100%;
        margin-top: 20px;
        font-size: 16px;
      }
      h1 {
        font-size: 28px;
        line-height: 28px;
      }
      .header p {
        font-size: 20px;
        padding-top: 15px;
      }
    }
  }
</style>